app/Helpers/helper.php

select * from `users` where `type` = 'superadmin' limit 1
---
    function settings($user_id = null)
    {
        // Skip database queries during installation
        if (request()->is('install/*') || request()->is('update/*') || !file_exists(storage_path('installed'))) {
            return [];
        }

        if (is_null($user_id)) {
            if (auth()->user()) {
                if (isSaas()) {
                    if (!in_array(auth()->user()->type, ['superadmin', 'company'])) {
                        $autherUserCreatedBy = auth()->user()->created_by;
                        $user_id = getCompanyId($autherUserCreatedBy);
                    } else {
                        $user_id = auth()->id();
                    }
                } else {
                    // Non-SaaS: Company is top level
                    if (auth()->user()->type === 'company') {
                        $user_id = auth()->id();
                    } else {
                        $user_id = auth()->user()->created_by;
                    }
                }
            } else {
                if (isSaas()) {
                    $user = User::where('type', 'superadmin')->first();
                } else {
                    $user = User::where('type', 'company')->first();

select `value`, `key` from `settings` where `user_id` = 1
---
        if (!$user_id) {
            return collect();
        }
        $userSettings = Setting::where('user_id', $user_id)->pluck('value', 'key')->toArray();